import logo from './logo.svg';
import './App.css';

// HW2 24.03.21
// 1 відмалювати список карточок базуючись на якомусь створеному вами масиві створити окрему кнопку,
// яка буде видаляти поточний перший елемент (або останній)  якщо у нас масив з 3 елементів і ми клікнули на кнопку 3 рази,
// то на екрані жодна карточка не має відмалюватись  (кнопки повернення до початкового стану не треба)
// 2 те саме, тільки з кнопкою реверт (повернутись до стану, де у нас видно 3 елемнети, як на початку)
// 3 задача з зірочкою) кожна карточка з завдання вище має мати кнопку, по кліку на яку,
// ми видаляємо зі списку саме її + реверт кнопка, щоб вернути все назад (ця кнопка одна дня всіх карточок,
// клікнули по ній і всі каркти вернулись назазд) (згадування функції фільтр в лекції було не просто так)
// 4 написати тогл компоненту, яка буде ховати або показувати елемент приклад з візуалкою тут https://material-ui.com/components/switches/#customized-switches
// 5 зміна теми по кнопці (світла/темна)

function App() {
    return (
        <div className="App">

        </div>
    );
}

export default App;
